Autodesk.Revit.DB.UpdaterRegistry.UnregisterUpdaterInternal(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document)
Unregisters an updater for the given document.
Remarks:
Unregistering an updater from a document is only permitted if
the updater was explicitly registered for that document.
If the updater was registered in other documents too,
the remaining documents will still have the updater assigned.
However, if after unregistering from the document the updater is found
not registered in any other (currently open) documents, the updater
will be completely removed from the registry including its triggers.
Should the updater be registered again later, the triggers need
to be re-applied.
id:
Id of updater to be unregistered.
document:
Document for which this updater is to be unregistered.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Attempting to unregister an updater that is currently being executed.
Since:
2027